def dijkstra(graph, start, end):
    # 시작 정점으로부터의 거리를 저장하는 딕셔너리
    distances = {vertex: float('infinity') for vertex in graph}
    distances[start] = 0  # 시작 정점의 거리는 0

    # 방문한 정점들을 기록하는 집합
    visited = set()

    while len(visited) < len(graph):
        # 아직 방문하지 않은 정점들 중에서 가장 가까운 정점을 찾음
        current_vertex = min((vertex for vertex in graph if vertex not in visited), key=lambda x: distances[x])

        # 현재 정점을 방문한 것으로 표시
        visited.add(current_vertex)

        # 현재 정점의 이웃 정점들을 반복
        for neighbor, weight in graph[current_vertex].items():
            distance = distances[current_vertex] + weight

            # 만약 현재 정점을 거쳐서 이웃 정점까지의 거리가 더 짧으면 업데이트
            if distance < distances[neighbor]:
                distances[neighbor] = distance

    return distances[end]

# 그래프를 딕셔너리로 표현

graph = {
    # 1호선

    # 병점 -> 서동탄
    '서동탄': {'병점': 300},

    # 금천구청 -> 광명
    '광명': {'금천구청': 300},

    #구로 -> 신창
    '가산디지털단지': {'독산': 120, '구로': 240},
    '독산': { '가산디지털단지': 120,  '금천구청': 120},
    '금천구청': { '독산': 120,  '석수': 180},
    '석수': {'금천구청': 180,  '관악': 120},
    '관악': { '석수': 120,  '안양': 180},
    '안양': { '관악': 180, '명학': 180},
    '명학': { '안양': 180, '금정': 120},
    #금정
    '군포': { '금정': 180, '당정': 60},
    '당정': { '군포': 60, '의왕': 120},
    '의왕': { '당정': 120, '성균관대': 180},
    '성균관대': { '의왕': 180, '화서': 120},
    '화서': { '성균관대': 120, '수원': 120},
    '수원': { '화서': 120, '세류': 180},
    '세류': { '수원': 180, '병점': 240},
    '병점': { '세류': 240, '세마': 180},
    '세마': { '병점': 180, '오산대': 120},
    '오산대': { '세마': 120, '오산': 180},
    '오산': {'오산대': 180, '진위': 180},
    '진위': {'오산': 180, '송탕': 180},
    '송탕': {'진위': 180, '서정리': 180},
    '서정리': {'송탕': 180, '평택지제': 240},
    '평택지제': {'서정리': 240 , '평택': 240},
    '평택': {'평택지제': 240, '성환':300},
    '성환': {'평택': 300, '직산': 240},
    '직산': {'성환': 240, '두정': 240},
    '두정': {'직산': 240, '천안': 240},
    '천안': {'두정': 240, '봉명': 120},
    '봉명': {'천안': 120, '쌍용': 120},
    '쌍용': {'봉명': 120, '아산': 120},
    '아산': {'쌍용': 120, '탕정': 180},
    '탕정': {'아산': 180, '배방': 180},
    '배방': {'탕정': 180, '온양온천': 240},
    '온양온천': {'배방': 240, '신창': 240},
    '신창': {'온양온천': 240},

    #연천 -> 인천
    '인천': {'동인천': 180},
    '동인천': {'인천': 180, '도원': 60},
    '도원': {'동인천': 60, '제물포': 60},
    '제물포': {'도원': 60, '도화': 60},
    '도화': {'제물포': 60, '주안': 60},
    '주안': {'도화': 60, '간석': 60},
    '간석': {'주안': 60, '동암': 120},
    '동암': {'간석': 120, '백운': 120},
    '백운': {'동암': 120, '부평': 120},
    '부평': {'백운': 120, '부개': 120},
    '부개': {'부평': 120, '송내': 60},
    '송내': {'부개': 60, '중동': 60},
    '중동': {'송내': 60, '부천': 120},
    '부천': {'중동': 120, '소사': 120},
    '소사': {'부천': 120, '역곡': 120},
    '역곡': {'소사': 120, '온수': 60},
    '온수': {'역곡': 60, '오류동': 120},
    '오류동': {'온수': 120, '개봉': 120},
    '개봉': {'오류동': 120, '구일': 120},
    '구일': {'개봉': 120, '구로': 120},
    '구로': {'구일': 120, '신도림': 120, '가산디지털단지': 240},
    # 신도림
    '영등포': {'신도림': 120, '신길': 120},
    '신길': {'영등포': 120, '대방': 60},
    '대방': {'신길': 60, '노량진': 120},
    '노량진': {'대방': 120, '용산': 180},
    '용산': {'노량진': 180, '남영': 120},
    '남영': {'용산': 120, '서울역': 180},
    # 서울역
    # 시청
    '종각': {'종로3가': 90, '시청': 120},
    # 종로 3가
    '종로5가': {'동대문': 90, '종로3가': 90},
    # 동대문
    '동묘앞': {'신설동': 90, '동대문': 60},
    # 신설동
    '제기동': {'청량리': 90, '신설동': 90},
    '청량리': {'제기동': 90, '회기': 120},
    '회기': {'청량리':120, '외대앞': 60},
    '외대앞': {'회기': 60, '신이문': 60},
    '신이문': {'외대앞': 60, '석계': 120},
    '석계': {'신이문': 120, '광운대': 120},
    '광운대': {'석계': 120, '월계': 120},
    '월계': {'광운대': 120, '녹천': 120},
    '녹천': {'월계': 120, '창동': 60},
    # 창동
    '방학': {'창동': 120, '도봉': 60},
    '도봉': {'방학': 60, '도봉산': 60},
    '도봉산': {'도봉': 60, '망월사': 120},
    '망월사': {'도봉산': 120, '화룡': 120},
    '화룡': {'망월사': 120, '의정부': 180},
    '의정부': {'화룡': 180, '가능': 120},
    '가능': {'의정부': 120, '녹양': 60},
    '녹양': {'가능': 60, '양주': 120},
    '양주': {'녹양': 120, '덕계': 300},
    '덕계': {'양주': 300, '덕정': 180},
    '덕정': {'덕계': 180, '지행': 240},
    '지행': {'덕정': 240, '동두천중앙': 60},
    '동두천중앙': {'지행': 60, '보산': 120},
    '보산': {'동두천중앙': 120, '동두천': 120},
    '동두천': {'보산': 120, '소요산': 180},
    '소요산': {'동두천': 180, '청산': 240},
    '청산': {'소요산': 240, '전곡': 180},
    '전곡': {'청산': 180, '연천': 480},
    '연천': {'전곡': 480},
    
    

    # 2호선
    # 시청
    '을지로입구': {'을지로3가': 60, '시청': 90},
    # 을지로3가
    '을지로4가': {'동대문역사문화공원': 60, '을지로3가': 60},
    # 동대문역사문화공원
    '신당': {'상왕십리': 60, '동대문역사문화공원': 90},
    '상왕십리': {'왕십리': 60, '신당': 60},
    '왕십리': {'한양대': 60, '상왕십리': 60},
    '한양대': {'뚝섬': 90, '왕십리': 60},
    '뚝섬': {'성수': 90, '한양대': 90},
    '성수': {'건대입구': 60, '뚝섬': 90, '용답': 180}, # 용답
    '건대입구': {'구의': 90, '성수': 60},
    '구의': {'강변': 120, '건대입구': 90},
    '강변': {'잠실나루': 60, '구의': 120},
    '잠실나루': {'잠실': 120, '강변': 60},
    '잠실': {'잠실새내': 60, '잠실나루': 120},
    '잠실새내': {'종합운동장': 90, '잠실': 60},
    '종합운동장': {'삼성': 90, '잠실새내': 90},
    '삼성': {'선릉': 60, '종합운동장': 90},
    '선릉': {'역삼': 60, '삼성': 60},
    '역삼': {'강남': 90, '선릉': 60},
    '강남': {'교대': 60, '역삼': 90},
    # 교대
    '서초': {'방배': 120, '교대': 90},
    '방배': {'사당': 120, '서초': 120},
    # 사당
    '낙성대': {'서울대입구': 60, '사당': 120},
    '서울대입구': {'봉천': 90, '낙성대': 60},
    '봉천': {'신림': 60, '서울대입구': 90},
    '신림': {'신대방': 120, '봉천': 60},
    '신대방': {'구로디지털단지': 90, '신림': 120},
    '구로디지털단지': {'대림': 90, '신대방': 90},
    '대림': {'신도림': 90, '구로디지털단지': 90},
    # 신도림
    '문래': {'영등포구청': 120, '신도림': 120},
    '영등포구청': {'당산': 60, '문래': 120},
    '당산': {'합정': 90, '영등포구청': 60},
    '합정': {'홍대입구': 150, '당산': 90},
    '홍대입구': {'신촌': 90, '합정': 150},
    '신촌': {'이대': 60, '홍대입구': 90},
    '이대': {'아현': 60, '신촌': 60},
    '아현': {'충정로': 90, '이대': 60},
    '충정로': {'시청': 90, '아현': 90},

    '용답': {'신답': 90, '성수': 180}, # 성수
    '신답': {'용답': 90, '용두': 90},
    '용두': {'신설동': 90, '신답': 90},
    # 신설동

    '도림천': {'양천구청': 90, '신도림': 60}, # 신도림
    '양천구청': {'도림천': 90, '신정네거리': 150},
    '신정네거리': {'양천구청': 150, '까치산': 90},
    '까치산': {'신정네거리': 90},

    # 3호선 (대화역 부터 삼송역 까지 없음)
    '대화': {'주엽': 120},
    '주엽': {'대화': 120, '정발산': 120},
    '정발산': {'주엽': 120, '마두': 60},
    '마두': {'정발산': 60, '백석': 120},
    '백석': {'대곡': 180, '마두': 120},
    '대곡': {'화정': 120, '백석': 180},
    '화정': {'원당': 180, '대곡': 120},
    '원당': {'원흥': 180, '화정': 180},
    '원흥': {'삼송': 120, '원당': 180},
    '삼송': {'지축': 120, '원흥': 120},
    '지축': {'구파발': 180, '삼송': 120},
    '구파발': {'연신내': 180, '지축': 180},
    '연신내': {'불광': 120, '구파발': 180},
    '불광': {'녹번': 90, '연신내': 120},
    '녹번': {'홍제': 90, '불광': 90},
    '홍제': {'무악재': 120, '녹번': 90},
    '무악재': {'독립문': 90, '홍제': 120},
    '독립문': {'경복궁': 90, '무악재': 90},
    '경복궁': {'안국': 120, '독립문': 90},
    '안국': {'종로3가': 90, '경복궁': 120},
    # 종로3가
    # 을지로3가
    # 충무로
    '동대입구': {'약수': 90, '충무로': 90},
    '약수': {'금호': 60, '동대입구': 90},
    '금호': {'옥수': 60, '약수': 60},
    '옥수': {'압구정': 60, '금호': 60},
    '압구정': {'신사': 120, '옥수': 60},
    '신사': {'잠원': 120, '압구정': 120},
    '잠원': {'고속터미널': 90, '신사': 120},
    '고속터미널': {'교대': 90, '잠원': 90},
    # 교대
    '남부터미널': {'양재': 90, '교대': 120},
    '양재': {'매봉': 120, '남부터미널': 90},
    '매봉': {'도곡': 120, '양재': 120},
    '도곡': {'대치': 90, '매봉': 120},
    '대치': {'학여울': 60, '도곡': 90},
    '학여울': {'대청': 60, '대치': 60},
    '대청': {'일원': 90, '학여울': 60},
    '일원': {'수서': 90, '대청': 90},
    '수서': {'가락시장': 120, '일원': 90},
    '가락시장': {'경찰병원': 120, '수서': 120},
    '경찰병원': {'오금': 60, '가락시장': 120},
    '오금': {'경찰병원': 60},

    # 4호선
    '당고개': {'상계': 90},
    '상계': {'노원': 90, '당고개': 90},
    '노원': {'창동': 120, '상계': 90},
    #창동
    '쌍문': {'수유': 90, '창동': 120},
    '수유': {'미아': 120, '쌍문': 90},
    '미아': {'미아사거리': 90, '수유': 120},
    '미아사거리': {'길음': 120, '미아': 90},
    '길음': {'성신여대입구': 120, '미아사거리': 120},
    '성신여대입구': {'한성대입구': 120, '길음': 120},
    '한성대입구': {'혜화': 90, '성신여대입구': 120},
    '혜화': {'동대문': 90, '한성대입구': 90},
    # 동대문
    # 동대문역사문화공원
    # 충무로
    '명동': {'회현': 60, '충무로': 60},
    '회현': {'서울역': 60, '명동': 60},
    # 서울역
    '숙대입구': {'삼각지': 90, '서울역': 90},
    '삼각지': {'신용산': 90, '숙대입구': 90},
    '신용산': {'이촌': 60, '삼각지': 90},
    '이촌': {'동작': 90, '신용산': 60},
    '동작': {'총신대입구': 180, '이촌': 90},
    '총신대입구': {'사당': 90, '동작': 180},
    # 사당
    '남태령': {'사당': 90, '선바위': 120},
    '선바위': {'남태령': 120, '경마공원': 60},
    '경마공원': {'선바위': 60, '대공원': 60},
    '대공원': {'경마공원': 60, '과천': 60},
    '과천': {'대공원': 60, '정부과천청사': 60},
    '정부과천청사': {'과천': 60, '인덕원': 180},
    '인덕원': {'정부과천청사': 180, '평촌': 120},
    '평촌': {'인덕원': 120, '범계': 60},
    '범계': {'평촌': 60, '금정': 180},
    # 금정
    '산본': {'금정': 240, '수리산': 60},
    '수리산': {'산본': 60, '대야미': 180},
    '대야미': {'수리산': 180, '반월': 120},
    '반월': {'대야미': 120, '상록수': 180},
    '상록수': {'반월': 180, '한대앞': 120},
    '한대앞': {'상록수': 120, '중앙': 120},
    '중앙': {'한대앞': 120, '고잔': 60},
    '고잔': {'중앙': 60, '초지': 120},
    '초지': {'고잔': 120, '안산': 120},
    '안산': {'초지': 120, '신길온천': 180},
    '신길온천': {'안산': 180, '정왕': 180},
    '정왕': {'신길온천': 180, '오이도': 180},
    '오이도': {'정왕': 180},

    # 환승역
    '창동': {'쌍문': 120, '노원': 120, '녹천': 60, '방학': 120},

    '금정': {'범계': 180, '산본': 240, '명학': 120, '군포': 180},

    '사당': {'남태령': 90, '총신대입구': 90, '낙성대': 120, '방배': 120},

    '서울역': {'숙대입구': 90, '회현': 60, '남영': 180, '시청': 120},

    '충무로': {'명동': 60, '동대문역사문화공원': 60, '동대입구': 90, '을지로3가': 60},

    '동대문역사문화공원': {'충무로': 60, '동대문': 90, '신당': 90, '을지로4가': 60},

    '동대문': {'동대문역사문화공원': 90, '혜화': 90, '동묘앞': 60, '종로5가': 90},

    '교대': {'남부터미널': 120, '고속터미널': 90, '서초': 90, '강남': 60},

    '을지로3가': {'충무로': 60, '종로3가': 60, '을지로4가': 60, '을지로입구': 60},

    '종로3가': {'을지로3가': 60, '안국': 90, '종로5가': 90, '종각': 90},

    '신도림': {'문래': 120, '대림': 90, '도림천': 60, '구로': 120, '영등포': 120},  # 도림천

    '시청': {'을지로입구': 90, '충정로': 90, '종각': 120, '서울역': 120},

    '신설동': {'제기동': 90, '동묘앞': 90, '용두': 90}
}
start_vertex = input("시작 정점을 입력하세요: ")
end_vertex = input("종착 정점을 입력하세요: ")

shortest_distance = dijkstra(graph, start_vertex, end_vertex)

minute = int(shortest_distance / 60)
second = int(shortest_distance % 60)

formatted_num1 = f'{minute:02d}'
formatted_num2 = f'{second:02d}'

print(f"{start_vertex}에서 {end_vertex}까지의 최단 거리: {formatted_num1}:{formatted_num2}분")
